In [15]:
import pandas as pd 
df = pd.read_csv('height_weight.csv')
df.head()

  gender     height      weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [16]:
Q1=df.height.quantile(.25)
Q1

63.505620481218955

In [17]:
Q3=df.height.quantile(.75)
Q3

69.1742617268347

In [18]:
df.describe()

             height        weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [19]:
IQR=Q3-Q1
IQR

5.668641245615746

In [20]:
lb=Q1-1.5*IQR
ub=Q3+1.5*IQR
print(lb,ub)

55.00265861279534 77.67722359525831

In [21]:
df_withoutoutliers = df[(df.height>lb) & (df.height<ub)]
df.head()

  gender     height      weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [22]:
df_withoutoutliers.describe()

            height       weight
count  9992.000000  9992.000000
mean     66.365006   161.422760
std       3.833980    32.019872
min      55.148557    68.982530
25%      63.509087   135.821269
50%      66.317827   161.197662
75%      69.169386   187.124646
max      77.547186   255.863326

In [23]:
df[(df.height<lb) | (df.height>ub)]

      gender     height      weight
994     Male  78.095867  255.690835
1317    Male  78.462053  227.342565
2014    Male  78.998742  269.989699
3285    Male  78.528210  253.889004
3757    Male  78.621374  245.733783
6624  Female  54.616858   71.393749
7294  Female  54.873728   78.606670
9285  Female  54.263133   64.700127

In [24]:
#outliers removing for weight in height_weight.csv